app/controllers/resumes_controller.rb

SELECT "resumes".* FROM "resumes" WHERE "resumes"."job_id" = ?  [["job_id", 3]]
---
  def index
    @resumes = Resume.all.where(job_id: params[:job_id])

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "resumes" SET "is_seen" = ?, "updated_at" = ? WHERE "resumes"."id" = ?  [["is_seen", "t"], ["updated_at", "2022-05-26 14:18:47.367683"], ["id", 26]]
---
  def show
    @resume = Resume.find params[:id]
    @resume.update_attribute(:is_seen, true) unless @resume.is_seen

INSERT INTO "resumes" ("cover_letter", "job_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cover_letter", "h"], ["job_id", 3], ["user_id", 1], ["created_at", "2022-05-25 18:38:44.988283"], ["updated_at", "2022-05-25 18:38:44.988283"]]
---
  def create
    @job = Job.find(params[:job_id])
    @resume  = @job.resumes.build(resume_params)
    @resume.user_id = current_user.id

    if @resume.save

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 15]]
---
  def destroy

    @resume = Resume.find(params[:id])
    @resume.destroy